feat: v0.6.0 docs updated
